Revit 2026 API

# MultiReferenceAnnotationTypeIsAllowedReferenceCategory Method

---

Checks if the reference category can be used with multi-reference annotations.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAllowedReferenceCategory(
	ElementId referenceCategoryId
)
```
```vb
Public Function IsAllowedReferenceCategory (
	referenceCategoryId As ElementId
) As Boolean
```
```cpp
public:
bool IsAllowedReferenceCategory(
	ElementId^ referenceCategoryId
)
```
```fsharp
member IsAllowedReferenceCategory :
        referenceCategoryId : ElementId -> bool
```

#### Parameters

referenceCategoryId ElementId
     The reference category to check.

#### Return Value

Boolean True when the reference category can be used by multi-reference annotations.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only Structural Rebar is allowed.

#### Reference

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace